let massSuperheroJSON = [{
    "picture":"https://n1s1.hsmedia.ru/13/a5/b2/13a5b2373d5e23489d9a4949ada5b927/547x397_0xac120002_8752067681540468870.jpg",
    "name":"Бэтмен",
    "universe":"DC Comics",
    "alterEgo":"Брюс Уэйн",
    "occupation":"борец с преступностью, филантроп, миллиардер",
    "friends":"Робин, Бэтгерл",
    "superPowers":"интеллект, обширные познания, знания боевых искусств, ловкость"
},{
    "picture":"https://n1s1.hsmedia.ru/06/d3/73/06d37321618034ec5f2a65b09c8576e3/547x397_0xac120002_45567661540468871.jpg",
    "name":"Супермен",
    "universe":"Супермен",
    "alterEgo":"Кларк Кент",
    "occupation":"борец за справедливость",
    "friends":"собака Крипто",
    "superPowers":"непробиваемость, суперсила, полет, самоисцеление, суперзрение и суперслух, классный костюм"
},{
    "picture":"https://n1s1.hsmedia.ru/7b/56/08/7b5608ec3df83d872fa1162fb9e32f28/547x397_0xac120002_1773711401540468871.jpg",
    "name":"Железный человек",
    "universe":"Marvel Comics",
    "alterEgo":"Тони Старк",
    "occupation":"гений, миллиардер, плейбой, филантроп",
    "friends":"Робин, Бэтгерл",
    "superPowers":"высокий уровень интеллекта, широкие познания науки и техники, связь со всемирной паутиной, бронекостюмы"
},{
    "picture":"https://n1s1.hsmedia.ru/37/39/74/373974effcc7ccd093d849e8fa062091/547x397_0xac120002_9548247751540468871.jpg",
    "name":"Спайдер-мен/Человек-паук",
    "universe":"Marvel Comics",
    "alterEgo":"Питер Паркер",
    "occupation":"борец за справедливость, студент, фотограф",
    "friends":"Мстители, Фантастическая четверка, Люди Икс",
    "superPowers":"сверхчеловеческие рефлексы, «паучье чутье», способность прилепляться к твердым поверхностям, производство паутины"
},{
    "picture":"https://n1s1.hsmedia.ru/41/8f/05/418f050c767eeca8854b328914c7bccc/547x397_0xac120002_20106541761540468871.jpg",
    "name":"Капитан Америка",
    "universe":"Marvel Comics",
    "alterEgo":"Стивен Роджерс",
    "occupation":"супер-солдат",
    "friends":"Мстители",
    "superPowers":"сила, выносливость, бессмертие, быстрая регенерация, мастерство скрытности и боя"
},{
    "picture":"https://n1s1.hsmedia.ru/52/a3/e1/52a3e14a0c8f02715b763e7a20fe1c00/547x397_0xac120002_19311926741540468872.jpg",
    "name":"Тор",
    "universe":"Marvel Comics",
    "alterEgo":" нет; полное имя — Тор",
    "occupation":"борец за справедливость, скандинавский бог",
    "friends":"Мстители",
    "superPowers":"все, что может бог, плюс молот Мьелнир"
},{
    "picture":"https://n1s1.hsmedia.ru/9a/28/e7/9a28e7b059594fc10387669ae4bd2f22/547x397_0xac120002_20162335021540468872.jpg",
    "name":"Халк",
    "universe":"Marvel Comics",
    "alterEgo":"Брюс Беннер",
    "occupation":"супергерой, борец за справедливость, ученый-биохимик",
    "friends":"Мстители",
    "superPowers":"сверхчеловеческая сила и скорость, выносливость, полет"
},{
    "picture":"https://n1s1.hsmedia.ru/87/ed/c5/87edc525d8813c7b2899e04a4e562fe9/547x397_0xac120002_6444132261540468872.jpg",
    "name":"Чудо-женщина",
    "universe":"DC Comics",
    "alterEgo":"Диана Принс",
    "occupation":"супергероиня, секретарь-референт",
    "friends":"Лига Справедливости, Бэтмен, Супермен",
    "superPowers":"сверхчеловеческая сила искорость, выносливость, полет"
},{
    "picture":"image/BlackWidow.jpg",
    "name":"Чёрная вдова",
    "universe":"Marvel Comics",
    "alterEgo":"Наташа Романофф",
    "occupation":"супергероиня, шпионка",
    "friends":"Мстители",
    "superPowers":"пик человеческого физического потенциала, замедленное старение, знание многих языков"
},{
    "picture":"https://n1s1.hsmedia.ru/e0/2b/55/e02b55b147eeaff9b3fe6bdbb36ff9ea/547x397_0xac120002_744074131540468872.jpg",
    "name":"Дэдпул",
    "universe":"Marvel Comics",
    "alterEgo":"Уэйд Уинстон Уилсон",
    "occupation":"антигерой, наемник",
    "friends":"частично Мстители, Человек-паук, Росомаха",
    "superPowers":"высокий болевой порог, регенерация и бессмертие, сверхчеловеческая иммунная система"
}];

let massDetailedInfoJSON = [{
    "name":"Бэтмен",
    "info":"По популярности человек-летучая мышь может сравниться только с Суперменом. Его образ кажется очень мистическим и мрачным: черный костюм с развевающимся плащом, устрашающий Бэтмобиль, штаб-квартира в сырой пещере. Его биография настолько же темна, как и образ. В детстве у него на глазах убили родителей, и юный Брюс поклялся всеми силами защищать родной Готэм от преступности. Брюс знаменит, несмотря на пожилой возраст: первый выпуск с его участием вышел аж в 1939 году. С каждым годом популярность только крепнет. Большую роль в этом сыграли экранизации: «Темный рыцарь», сериал «Готэм» и несколько одноименных картин. Главная причина такой любви среди фанатов — мысль, что каждый может стать Бэтменом. Если подумать, это один из немногих героев, кто добился своего положения за счет ума и упорства, а не за счет мутаций."
},{
    "name":"Супермен",
    "info":"Полная противоположность своему противнику Бэтмену. Если Брюс Уэйн был простым человеком и стал героем, то Супермен героем родился, но вынужден был изображать выходца из бедной канзасской семьи. Последний представитель планеты Криптон был отправлен на Землю прямо перед тем, как его родина была уничтожена. Супермен — некий хамелеон от мира комиксов. В своем первом выпуске в 1938 году он был просто человек-огромный мускул, который умел только разбивать стены и выбивать двери. Позднее к его умениям добавилась способность летать. Дальше у многочисленных воплощений Кларка, от подростка в «Тайнах Смоллвиля» до величественного «Человека из стали», разный уровень и количество суперспособностей. Неизменным остается его слабое место — уязвимость к Криптониту, радиоактивному веществу с родной планеты."
},{
    "name":"Железный человек",
    "info":"Пожалуй, самый популярный современный супергерой. У него много общего с мрачной птицей ночи Бэтменом: оба потеряли родителей в детстве, стали борцами с преступностью без особых сверхсил, невероятно богатые. Только если Бэтменом восхищаются, то Тони Старка — обожают :) То ли дело в шикарной актерской игре Роберта Дауни мл., который выбил роль у Николаса Кейджа и Тома Круза, то ли в хорошо прописанном персонаже. Прототипом для героя послужили Илон Маск и изобретатель Говард Хьюз. Железный Человек не всегда ходил в красном модном костюме: в своих первых версиях 1963 года он был скромного серого цвета. Увы, в киновоплощении бронекостюм даже не из металла — его делали из пластика и стекловолокна."
},{
    "name":"Спайдер-мен/Человек-паук",
    "info":"Человек-паук родился от потребности Marvel Comics создать героя-подростка. Другие супергерои вроде Бэтмена и Супермена — взрослые мужчины, и целевая аудитория не видела в них примеры для подражания. Пятнадцатилетний Питер Паркер дал понять всем тинейджерам Земли, что можно и злодеев уничтожить, и на красавице жениться. Для этого даже не обязательно быть суперкрасавчиком! Всего лишь нужен укус паучка. Питер не сразу использовал свои силы во благо людей: изначально он хотел делать на них деньги, участвуя в нелегальных боях без правил. Затем его любимый дядя Бен умер от рук грабителя, и подросток поклялся, что очистит свой родной Нью-Йорк ото зла. Однако спустя время подросток понял, что одной клятвы недостаточно и что «с великой силой приходит великая ответственность». Кстати, не все суперсилы у Питера появились за счет мутации: парень самостоятельно взломал технологию Тони Старка, после чего заслужил его признание. "
},{
    "name":"Капитан Америка",
    "info":"Капитан Америка — персонаж, целеноправленно созданный, чтобы воплощать идеалы патриотизма. Потому он был особенно популярный во время Второй мировой войны. В комиксах обращение «Капитан Америка» применяется к любому, кто выбран правительством США. Больше всего оно закрепилось именно за Стивом Роджерсом. Стив родился в 1917 году в семье ирландских эмигрантов Сары и Джозефа Роджерсов. В детстве он был очень слабым юношей и постоянно подвергался насмешкам со стороны других ребят. Ирландские корни давали о себе знать, потому парень от драки не лез. В начале Второй мировой войны Стивен стремился попасть на фронт. Естественно, из-за здоровья ему отказывали. По воле судьбы ему предложили принять участие в секретном оборонном проекте, целью которого было создание суперсолдат. Несмотря на сложности во время эксперимента, результат был успешным. Роджерс превратился из хилого юноши в настоящего Аполлона. Актер Крис Эванс с этой ролью вполне справился."
},{
    "name":"Тор",
    "info":"Персонаж Тора основан на образе одноименного скандинавского бога. Тор во вселенной Marvel — родной сын Одина и древнейшей богини Геи. После рождения сына Один забрал его в Асгард, где растил вместе со своей женой, богиней Фригг. Последнюю Тор всегда считал своей настоящей матерью и лишь много позже узнал правду о своем рождении. Стоит сказать, что до нынешнего Тора в исполнении Криса Хемсворта у супергероя было несколько воплощений. В одном из них он погиб в схватке с мифическим змеем Мидгардом. Это привело к Рагнареку — некоему апокалипсису в скандинавской мифологии."
},{
    "name":"Халк",
    "info":"Идею создания Халка как персонажа можно отнести к фантастической новелле «Странная история доктора Джекила и мистера Хайда», в которой ученый не может примириться со своим демоническим альтер эго. Прошлое у Халка — хуже некуда: отец Брюса страдал от алкоголизма и приступов ярости, а мать пыталась всеми силами уберечь сына от гнева своего мужа. Она погибла, защищая своего единственного ребенка от его побоев. Пронеся через все детство тяжелый психологический груз, Брюс вырос в чрезвычайно одаренного, но замкнутого юношу. Хотя Брюс не мог уважать отца, но пошел в науке по его стопам и выбрал ядерную физику. Во время эксперимента он ввел себе пробную сыворотку и подверг себя воздействию большого количества гамма-радиации. Беннер превратился в мускулистого неуправляемого гиганта, который крушил все вокруг и не понимал, что происходит. Так имя Халка стало нарицательным для людей, который не могут держать себя в руках."
},{
    "name":"Чудо-женщина",
    "info":"Пора бы разбавить эту мужскую вечеринку по-настоящему крутой девчонкой. Принцесса-амозонка родилась на мистическом острове Темескира, расположенном в центре Бермудского треугольника, где пропадают самолеты. Свое настоящее имя — Диана — она получила в честь древнегреческой богини охоты, а суперспособности — от богини любви Афродиты. Растили героиню в исключительно женском обществе, поэтому Чудо-женщина часто появляется в культуре как символ феминизма. У Дианы есть супер-снаряжение: лассо истины и тиара. Первое было сковано богом огня Гефестом, и оно никогда не промахивается. Человек, попавший в его петлю, неизбежно расскажет свои секреты, вспомнит забытое и даже подчинится приказам. Тиара же работает как метательное оружие, способное рассечь что угодно. Корона со звездой в центре символизирует патриотизм американской героини и служит стильным аксессуаром."
},{
    "name":"Чёрная вдова",
    "info":"Супергероиня российского происхождения родилась предположительно в 1928 году в Сталинграде. Во время Второй мировой войны она потеряла родителей и была спасена из горящего дома советским солдатом. Тот на некоторое время стал ее опекуном. Повзрослев, Наташа попала в организацию «Красная Комната», где прошла многочисленные тренировки, а именно — была частью шпионской программы. Там же ей вживили сыворотку Суперсолдата — как у Капитана Америки, но в советском варианте. Благодаря ей Наташа может использовать максимальные возможности своего организма: силу, гибкость, скорость, ловкость и т. д. Также сыворотка дает эффект замедленного старения. По мнению фанатов, самое главное преимущество Черной Вдовы — то, что ее сыграла красотка Скарлетт Йоханссон."
},{
    "name":"Дэдпул",
    "info":"Как и Росомаха из Людей Икс, Дэдпул был подвергнут опытам по программе «Оружие Икс». Ученые попытались исцелить его рак, привив его клеткам способность к регенерации. Как и всегда в комиксах, что-то пошло не так, и Дэдпул остался изуродованным и психически нестабильным. Это единственный супергерой из списка, который однозначно не на стороне добра. Дэдпул наслаждается насилием. Первоначально появившись в основной Вселенной Marvel, он получил альтернативные варианты в других реальностях Мультивселенной. Что оставалось неизменным — его циничное, черное чувство юмора: за него Дэдпула прозвали «Болтливым наемником»."
}];

let arrayLikes = []; //массив лайков

//функция загрузки страницы
document.addEventListener("DOMContentLoaded", function (event) {
    //заполнение страницы
    for (let i=0; i < massSuperheroJSON.length; i++){
        createSuperhero();//вызов ф-ии создания элементов на странице html
        //заполнение данными элементов на странице
        document.getElementsByClassName('card-img-top')[i].src = massSuperheroJSON[i].picture;
        document.getElementsByClassName('card-img-top')[i].alt = massSuperheroJSON[i].name;
        document.getElementsByClassName('card-title')[i].innerHTML = massSuperheroJSON[i].name;
        document.getElementsByClassName('card-title')[i].value = massSuperheroJSON[i].name;
        document.getElementsByClassName('universe')[i].innerHTML = `Вселенная: ${massSuperheroJSON[i].universe}`;
        document.getElementsByClassName('alterEgo')[i].innerHTML = `Альтер эго: ${massSuperheroJSON[i].alterEgo}`;
        document.getElementsByClassName('occupation')[i].innerHTML = `Род деятельности: ${massSuperheroJSON[i].occupation}`;
        document.getElementsByClassName('friends')[i].innerHTML = `Друзья: ${massSuperheroJSON[i].friends}`; 
        document.getElementsByClassName('superPowers')[i].innerHTML = `Суперсилы: ${massSuperheroJSON[i].superPowers}`;
        document.getElementsByClassName('btn btn-primary')[i].value = massSuperheroJSON[i].name;
        document.getElementsByClassName('btn btn-info')[i].value = massSuperheroJSON[i].name;
    }

    //проверка на наличие информации в localStorage
    if (localStorage.getItem('like') != null) {
        arrayLikes = JSON.parse(localStorage.getItem('like')); //формируем массив arrayLikes из данных(лайков), которые лежат в localStorage
        for(let i = 0; i < arrayLikes.length; i++){ //пробегаем по arrayLikes для выявления совпадения
            for(let j = 0; j < massSuperheroJSON.length; j++){//пробегаем по massSuperheroJSON для выявления совпадения 
                if(document.getElementsByClassName('btn btn-info')[j].value == arrayLikes[i]){ //если совпадение нашей коллекции и arrayLikes найдены
                    document.getElementsByClassName('btn btn-info')[j].classList.toggle("btn-danger"); //то добавляем к элементу коллекции новый класс для изменния цвета
                }
            }
        }
    }
});

//ф-ия по созданию элементов на странице html
function createSuperhero() {
    let mainDiv = document.getElementById('mainDiv');

    let divCol = document.createElement('div');
    divCol.className = "card col-xl-4 col-lg-4 col-md-6 col-sm-6 col-xs";
    divCol.style = "width: 18rem;";
    mainDiv.appendChild(divCol);

    let imgSpr = document.createElement('img');
    imgSpr.className = "card-img-top";
    imgSpr.src = " ";
    imgSpr.alt = " ";
    divCol.appendChild(imgSpr);

    let divCard = document.createElement('div');
    divCard.className = "card-body";
    imgSpr.after(divCard);

    let heading1 = document.createElement('h4');
    heading1.className = "card-title";
    divCard.appendChild(heading1);

    let line1 = document.createElement('p');
    line1.className = "card-text universe";
    heading1.after(line1);

    let line2 = document.createElement('p');
    line2.className = "card-text alterEgo";
    line1.after(line2);

    let line3 = document.createElement('p');
    line3.className = "card-text occupation";
    line2.after(line3);

    let line4 = document.createElement('p');
    line4.className = "card-text friends";
    line3.after(line4);

    let line5 = document.createElement('p');
    line5.className = "card-text superPowers";
    line4.after(line5);

    let bdtDetailed = document.createElement('button');
    bdtDetailed.type = "button";
    bdtDetailed.className = "btn btn-primary";
    bdtDetailed.textContent = "Подробнее";
    bdtDetailed.value = " ";
    line5.after(bdtDetailed);
    
    //слушатель для кнопки Подробнее, при её нажатии вызывает ф-ию bdtDetailedInfo
    bdtDetailed.addEventListener("click", bdtDetailedInfo); 

    let divStar = document.createElement('div');
    divStar.className = "divStarStyle";
    divCard.after(divStar);

    let heading2 = document.createElement('h5');
    heading2.className = "card-text";
    heading2.style = "margin-top: 10px;"
    heading2.textContent = "Ваш лайк:";
    divStar.appendChild(heading2);

    let buttonLike = document.createElement('button');
    buttonLike.type = "button";
    buttonLike.className = "btn btn-info";
    buttonLike.textContent = "❤";
    heading2.after(buttonLike);

    //слушатель для кнопки Лайк "❤", при её нажатии вызывает ф-ию buttonLikeGet
    buttonLike.addEventListener("click", buttonLikeGet);
}

//ф-ия срабатывает при нажатии на кнопку Подробнее
function bdtDetailedInfo(event){
    for(let i=0; i < massSuperheroJSON.length; i++){//пробегаем по massSuperheroJSON
        if(massSuperheroJSON[i].name == event.target.value){ //ищем совпадение имени в massSuperheroJSON с текущем value кнопки Пожробнее
            Swal.fire(//данная функция формирует модальное окно с данными
                event.target.value, //имя героя
                massDetailedInfoJSON[i].info //информация о нём
            );
        }
    }
}

//ф-ия срабатывает при нажатии на кнопку Лайк
function buttonLikeGet(event){
    //т.к. произвелось нажатие, изменяем цвет нажатой кнопки
    event.target.closest(".btn-info").classList.toggle("btn-danger");
    //данные нажатой кнопки помещаем в массив и записываем массив в localStorage
    arrayLikes.push(event.target.value);
    localStorage.setItem('like', JSON.stringify(arrayLikes));
}